Revit 2024 API
ConnectionInputPointInfo Constructor (String, Int32, String)
 Construct an input point info.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public ConnectionInputPointInfo(
	string ptSelectionText,
	int inputMemberIndex,
	string restrictionType
)
Visual Basic
Public Sub New ( _
	ptSelectionText As String, _
	inputMemberIndex As Integer, _
	restrictionType As String _
)
Visual C++
public:
ConnectionInputPointInfo(
	String^ ptSelectionText,
	int inputMemberIndex,
	String^ restrictionType
)
Parameters
ptSelectionText
Type: System.String
inputMemberIndex
Type: System.Int32
restrictionType
Type: System.String
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ConnectionInputPointInfo Class
ConnectionInputPointInfo Overload
Autodesk.Revit.DB.Structure Namespace